import { Box, BoxContent } from "../../public/css/StyledComponents";

export default function BodyPart2() {
    return (
        <>
            <Box style={{marginTop:'70vh',textAlign:'right',lineHeight:'0.8'}}>
                <BoxContent>
                    <h2>داستان زندگی من</h2>
                    <br />
                    <div>
                        <p>من از بچگی همیشه به آسمون نگاه میکردم و فکر میکردم ما از کجا اومدیم؟ دقیقا</p>
                        <p>کجای دنیایم؟ همیشه هم به ستاره ها و ماه نگاه میکردم و 2 سال بعد زمانی که 6</p>
                        <p>سالم بود شروع کردم به یادگیری هرچیزی که به فضا مربوطه از موشک تا ستاره شناسی</p>
                        <p>و جست و جو درباره ی افرادی که در این حوضه ربط داشته اند. بعد از شروع مدارس</p>
                        <p>به درس اهمیت بیشتر دادم و سعی کردم شاگرد اول باشم و سعی میکردم به مطالب خوب</p>
                        <p>گوش بدم ولی سال پنجم با برنامه نویسی اشنا شدم. ابتدا به بازی سازی علاقه پیدا</p>
                        <p>کردم و شروع کردم به یادگیری پایتون و یک مدت فقط پایتون بلد بودم و پایه ی html</p>
                        <p>css و javascript را یادگرفتم. سپس حوضه ی اصلیم رو انتخاب کردم. بازی سازی ولی به</p>
                        <p>دلایل قطعی نت نتونستم در این حوضه فعالیت کنم و رفتم سراغ حوضه ی وب. بعد از حرفه ای</p>
                        <p>شدن در فلسک و html css javascript شروع کردم به پروژه زدن و اینکار تا 1 سال بعدش ادامه</p>
                        <p>پیدا کرد. اخر تصمیم گرفتم react.js و next.js یاد بگیرم و قبل از آن php و ++C در حد</p>
                        <p>Junior یاد گرفتم. الان درحال حاضر با این دانش دارم با شما صحبت میکنم.</p>
                    </div>
                </BoxContent>
            </Box>
        </>
    )
}